Revit 2027 API
Extrusion.EndOffset Property
The offset of the end of the extrusion relative to the sketch plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EndOffset { get; set; }
Public Property EndOffset As Double
	Get
	Set
public:
property double EndOffset {
	double get ();
	void set (double value);
}
member EndOffset : float with get, set
Property Value
Double
Remarks
The direction of the offset is based on the normal of the extrusion's sketch plane: a positive value is in the direction of the normal, a negative value is in the other direction.
See Also
Reference
Extrusion Class
Autodesk.Revit.DB Namespace